app/controllers/real_states_controller.rb

  def index
    @real_states = RealState.all
---
SELECT `real_states`.* FROM `real_states`

  def create
    @real_state = RealState.new(real_state_params)
    if @real_state.save
---
INSERT INTO `real_states` (`name`, `type_col`, `city`, `country`) VALUES ('222', 'typecol2', 'Mty', 'Mexico')

  def destroy
      @real_state = RealState.find_by_id params[:id]
      message = {}
      if @real_state
        @real_state.destroy
---
SELECT `real_states`.* FROM `real_states` WHERE `real_states`.`id` = 2 LIMIT 1
DELETE FROM `real_states` WHERE `real_states`.`id` = 3

  def update
    @real_state = RealState.find_by_id params[:id]
    message = {}
    if @real_state
      @real_state.update(real_state_params)
---
SELECT `real_states`.* FROM `real_states` WHERE `real_states`.`id` = 3 LIMIT 1
UPDATE `real_states` SET `real_states`.`name` = '45455', `real_states`.`type_col` = 'typecol3' WHERE `real_states`.`id` = 7